package ru.gb.makulin.mymoviefinder.model

//TODO убрать временную заглушку
fun getTopRatedMovies(): List<Movie> = listOf(
    Movie(
        "суть такова",
        "28/11/2001",
        11.0,
        listOf("фантастика", "триллер"),
        155,
        "Здраствуйте. Я, Кирилл. Хотел бы чтобы вы сделали игру, 3Д-экшон суть такова... Пользователь может играть лесными эльфами, охраной дворца и злодеем. И если пользователь играет эльфами то эльфы в лесу, домики деревяные набигают солдаты дворца и злодеи. Можно грабить корованы... И эльфу раз лесные то сделать так что там густой лес..."
    ),
    Movie("2", "2002", 6.2),
    Movie("3", "2003", 6.3),
    Movie("4", "2004", 6.4),
    Movie("5", "2005", 6.5),
    Movie("6", "2006", 6.6),
    Movie("7", "2007", 6.7),
    Movie("8", "2008", 6.8),
)

//TODO убрать временную заглушку
fun getNewMovies(): List<Movie> = listOf(
    Movie("8", "2008", 6.8),
    Movie("7", "2007", 6.7),
    Movie("6", "2006", 6.6),
    Movie("5", "2005", 6.5),
    Movie("4", "2004", 6.4),
    Movie("3", "2003", 6.3),
    Movie("2", "2002", 6.2),
    Movie("1", "2001", 6.1),
)

//TODO убрать временную заглушку
fun getUpcomingMovies(): List<Movie> = listOf(
    Movie("5", "2005", 6.5),
    Movie("6", "2006", 6.6),
    Movie("7", "2007", 6.7),
    Movie("8", "2008", 6.8),
    Movie("1", "2001", 6.1),
    Movie("2", "2002", 6.2),
    Movie("3", "2003", 6.3),
    Movie("4", "2004", 6.4),
)
